{
  "heading": "Projects",
  "fuelprices": {
    "text": {
      "p1": "My Fuelprices application consists of a Python webscraper that reads the current fuel prices of the Avanti and Jet gas stations in St. Pölten every hour and stores them in a PostgreSQL database.",
      "p2": "The backend is a Java Spring RESTful web service and the frontend I implemented with Svelte.",
      "p3": "Additionally, I wrote a Telegram bot that you can ask for the latest prices and it will notify you of new weekly/monthly lows."
    }
  },
  "blur-fit": {
    "title": "Blur Fit - Mobile App 📱",
    "text": {
      "p1": "Blur Fit is a simple mobile app that I developed because I was looking for an app that could fit an image into a certain aspect ratio while filling the remaining area with a blurred version of the image, and I couldn't find an app with the exact functionality i wanted.",
      "p2": "For the basic design of the app, I used Figma and for the implementation, I used Flutter."
    }
  },
  "personal-website": {
    "title": "Personal Website",
    "text": {
      "p1": "My personal website is my first attempt to create a website using a JavaScript framework. 👀",
      "p2": "The framework I chose is Next.js, because it offers some advantages over regular React, e.g. SSR (Server-Side Rendering).",
      "p3": "I also used Tailwind CSS. 🖌️"
    },
    "links": {
      "link1": "Source Code"
    }
  },
  "diploma-thesis": {
    "title": "AI Interpretation of Stock Market News - Diploma Thesis ✍️",
    "text": {
      "p1": "My diploma thesis deals with the topics of artificial intelligence and Natural Language Processing. The goal of the thesis was to develop an application that uses Natural Language Processing to anylize stock market news about the DAX and to provide an estimate, based on previous forecasts, which stock market news site best predicts the development of the DAX.",
      "p2": "This project was realized in a team of 4. My task was to train a Natural Language Processing model that was able to evaluate stock market news about the DAX."
    },
    "links": {
      "link1": "Show PDF"
    }
  }
}
