{
  "heading": "Projekte",
  "fuelprices": {
    "text": {
      "p1": "Meine Fuelprices Applikation besteht aus einem Python Webscraper, der stündlich die aktuellen Benzinpreise der Avanti und Jet Tankstellen in St. Pölten liest und in eine PostgreSQL Datenbank speichert.",
      "p2": "Als Backend dient ein Java Spring RESTful Webservice und das Frontend habe ich mit Svelte umgesetzt.",
      "p3": "Zusätzlich habe ich einen Telegram Bot geschrieben, den man nach den neuesten Preisen fragen kann und der einen über neue wöchentliche/monatliche Tiefpreise benachrichtigt."
    }
  },
  "blur-fit": {
    "title": "Blur Fit - Mobile App 📱",
    "text": {
      "p1": "Blur Fit ist eine simple Mobile App, die ich entwickelt habe, da ich nach einer App gesucht habe, mit der man ein Bild in ein gewisses Seitenverhältnis bringen kann, wobei die übrige Fläche mit einer verschwommenen Version des Bildes gefüllt wird, und ich keine App dieser Art gefunden habe.",
      "p2": "Für das grundlegende Design der App habe ich Figma verwendet und für die Umsetzung Flutter."
    },
    "links": {
      "link1": "Play Store (Coming soon)"
    }
  },
  "personal-website": {
    "title": "Persönliche Website",
    "text": {
      "p1": "Bei meiner persönlichen Website handelt es sich um meinen ersten Versuch eine Website mithilfe eines JavaScript Frameworks zu erstellen. 👀",
      "p2": "Das Framework für das ich mich entschieden habe ist Next.js, da es einige Vorteile gegenüber gewöhnlichem React bietet, z. B. SSR (Server-Side Rendering).",
      "p3": "Zusätzlich habe ich Tailwind CSS verwendet. 🖌️"
    },
    "links": {
      "link1": "Source Code"
    }
  },
  "diploma-thesis": {
    "title": "AI Interpretation von Börsennews - Diplomarbeit ✍️",
    "text": {
      "p1": "Meine Diplomarbeit beschäftigt sich mit dem Themen der künstlichen Intelligenz und des Natural Language Processings. Ziel der Diplomarbeit war es, eine Anwendung zu entwickeln, die mithilfe von Natural Language Processing, Börsennews über den DAX anylisiert und eine Schätzung, aufgrund vorheriger Prognosen, zu liefern, welche Börsennewsseite am besten die Entwicklung des DAX vorhersagt.",
      "p2": "Dieses Projekt wurde in einem Team von 4 Personen umgesetzt, wobei meine Aufgabe es war, ein Natural Language Processing Modell zu trainieren, das dazu in der Lage war, Börsennews über den DAX zu bewerten."
    },
    "links": {
      "link1": "PDF anzeigen"
    }
  }
}
